## Import data from Relational Database(Ex: SQLite)

#### Relational Database
- A relational database is a set of formally described tables from which data can be accessed or reassembled in many different ways without having to reorganize the database tables

1. Some of the relational databases are
    - MySQL
    - PostgreSQL
    - SQLite
    - Sqlserver
    - Oracle
    - Hive

2. SQLite database
    - Small. Fast. Reliable
    - for more: https://www.sqlite.org/about.html

3. SQLAlchemy is ORM tool
    - It is the Python SQL toolkit. - Works with many Relational Database Management Systems 
    - For more: https://docs.sqlalchemy.org/en/13/orm/tutorial.html

### 1. List SQLite chinook database tables

In [9]:
from sqlalchemy import create_engine
# if module not found error 
# open anaconda prompt and run 
# conda install -c anaconda sqlalchemy

#### create_engine?
- Signature: create_engine(*args, **kwargs)
    - engine = create_engine("postgresql://scott:tiger@localhost/test")
    - engine = create_engine("mysql://scott:tiger@hostname/dbname",encoding='latin1', echo=True)
- Docstring: it is a function. Create a new :class:`.Engine` instance.

In [1]:
import os
os.chdir("E:/code/5.DataAnalysisOfficial/data/pandas")
os.getcwd()

'E:\\code\\5.DataAnalysisOfficial\\data\\pandas'

In [2]:
from sqlalchemy import create_engine

engine = create_engine('sqlite:///Chinook.sqlite')

In [3]:
type(engine)

sqlalchemy.engine.base.Engine

In [4]:
# total tables present inside the chinook file
engine.table_names()

['Album',
 'Artist',
 'Customer',
 'Employee',
 'Genre',
 'Invoice',
 'InvoiceLine',
 'MediaType',
 'Playlist',
 'PlaylistTrack',
 'Track']

### Method 1: Using direct connection

#### SQLite basic select query

Work flow has seven steps
    - Import packages and functions
    - Create the database engine
    - Connect to the engine
    - Query the database
    - Save query results to a DataFrame
    - Close the connection
    - Observe dataframe data

#### Step1: Import required packages and functions

In [15]:
from sqlalchemy import create_engine
import pandas as pd

#### Step2: Create Engine

In [16]:
engine = create_engine('sqlite:///Chinook.sqlite') 
type(engine)

sqlalchemy.engine.base.Engine

#### Step3: open engine connection

In [17]:
con = engine.connect()
type(con)

sqlalchemy.engine.base.Connection

#### Step4: query the DB for result

In [18]:
result_set = con.execute("Select *  from Customer")
type(result_set)

sqlalchemy.engine.result.ResultProxy

#### Step5: Save results of the query to DF

In [19]:
df = pd.DataFrame(data=result_set.fetchall(),
             columns=result_set.keys())

In [20]:
result_set.keys()

['CustomerId',
 'FirstName',
 'LastName',
 'Company',
 'Address',
 'City',
 'State',
 'Country',
 'PostalCode',
 'Phone',
 'Fax',
 'Email',
 'SupportRepId']

In [21]:
type(df)

pandas.core.frame.DataFrame

#### Step6: Close connection

In [22]:
con.close()

In [23]:
con.closed

True

#### Step7: print head of DF

In [24]:
df[0:3]

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
2,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3

In [25]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('sqlite:///Chinook.sqlite')
con = engine.connect()
result_set = con.execute("Select *  from Customer")
df = pd.DataFrame(data=result_set.fetchall(),columns=result_set.keys())
con.close()
df[0:3]

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
2,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3

In [26]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('sqlite:///Chinook.sqlite')
con = engine.connect()
result_set = con.execute("Select title,name from Album,Artist where Album.Artistid=Artist.Artistid")
df = pd.DataFrame(data=result_set.fetchall(),columns=result_set.keys())
con.close()
df[0:3]

                                   Title    Name
0  For Those About To Rock We Salute You   AC/DC
1                      Balls to the Wall  Accept
2                      Restless and Wild  Accept

### Limitation : we need to close connection Manually

## Method 2: With Conjugate(to close connection automatically)

In [27]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('sqlite:///Chinook.sqlite')
with engine.connect() as con:
    result_set = con.execute("""Select title,name from Album,Artist 
                                where Album.Artistid=Artist.Artistid""")
    df = pd.DataFrame(data=result_set.fetchmany(size=3),columns=result_set.keys())
    df.columns = result_set.keys() #print column names

In [28]:
df.columns

Index(['Title', 'Name'], dtype='object')

In [29]:
df.head()

                                   Title    Name
0  For Those About To Rock We Salute You   AC/DC
1                      Balls to the Wall  Accept
2                      Restless and Wild  Accept

In [31]:
from sqlalchemy import create_engine
import pandas as pd 

engine = create_engine('sqlite:///Chinook.sqlite')

with engine.connect() as con:
    rs = con.execute("""SELECT * FROM Employee WHERE EmployeeId >= 6 ORDER BY BirthDate""")
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

df.head()

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,8,Callahan,Laura,IT Staff,6,1968-01-09 00:00:00,2004-03-04 00:00:00,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com
1,7,King,Robert,IT Staff,6,1970-05-29 00:00:00,2004-01-02 00:00:00,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
2,6,Mitchell,Michael,IT Manager,1,1973-07-01 00:00:00,2003-10-17 00:00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com

### Method 3: using pandas

In [33]:
from sqlalchemy import create_engine;
import pandas as pd 

engine = create_engine('sqlite:///Chinook.sqlite') 

# Execute query and create DataFrame: df
df = pd.read_sql_query("SELECT * FROM Album", engine) 
df.head() # Print head of DataFrame

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [34]:
#compare pandas result with context manager result
# Open engine in context manager, run query and save results to DataFrame: df1
with engine.connect() as con:
    rs = con.execute("SELECT * FROM Album")
    df1 = pd.DataFrame(rs.fetchall())
    df1.columns = rs.keys()

In [36]:
# Confirm that both methods yield the same result: does df = df1 ?
df.equals(df1)

True

<a>https://www.sqlitetutorial.net/sqlite-python/</a>

In [ ]:
# Install mongo
# query collections(Tables)
# learn basic queries to get document(row)
# explore pymongo package

In [38]:
# Install sql server
# query Tables
# learn basic queries to get row
# explore pyodbc package

In [39]:
# Install bigdata
# query hive Tables
# learn basic queries to get row
# explore pyhive package